       identification division.
       program-id. hello.
       environment division.
       data division.
       procedure division.
       hello.
        display "HELLO"
        display "COBOL"
        stop run.
