       identification division.
       program-id. name.
       environment division.
       data division.
       procedure division.
       name.
        display "HOSHIDA"
        display "HOSHIDA"
        display "HOSHIDA"
        display "HOSHIDA"
        stop run.
