       identification division.
       program-id. roop.
       environment division.
       data division.
       procedure division.
       roop.
        perform 1000 times
         display "HEY"
        end-perform
        stop run.
