       identification division.
       program-id. sample.
       environment division.
       data division.
       procedure division.
       sample.
        display "HEY"
        display 'HEY'
        stop run.
