       IDENTIFICATION DIVISION.
       PROGRAM-ID. UPDATE02.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SAMPLE-FILE ASSIGN TO 'test01.txt'
       ORGANIZATION IS LINE SEQUENTIAL
       FILE STATUS IS IN-FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD SAMPLE-FILE.
       01 OUT-FILE-REC PIC X(50).
       01 IN-FILE-REC PIC X(50).
       WORKING-STORAGE SECTION.
       01 IN-FILE-STATUS PIC XX.
       01 ITEM PIC X(50).
       PROCEDURE DIVISION.
       OPEN OUTPUT SAMPLE-FILE.
       DISPLAY "レコードの書き込み";
       PERFORM UNTIL ITEM = "99"
       DISPLAY "レコードを入力してください(終了：99)。
       >> " WITH NO ADVANCING
       ACCEPT ITEM
       IF ITEM NOT= "99" THEN
       MOVE ITEM TO OUT-FILE-REC
       WRITE OUT-FILE-REC
       DISPLAY "WRITE: "OUT-FILE-REC
       END-IF
       END-PERFORM.
       CLOSE SAMPLE-FILE
       OPEN INPUT SAMPLE-FILE.
       DISPLAY "レコードの読み込み";
       *>1レコードずつ読み込む
       PERFORM UNTIL IN-FILE-STATUS NOT = "00"
       READ SAMPLE-FILE
       AT END
       DISPLAY "READ END";
       NOT AT END
       DISPLAY "READ: "IN-FILE-REC
       END-READ
       END-PERFORM.
       CLOSE SAMPLE-FILE.
       STOP RUN.
