     *>A.1.B..+....2....+....3....+....4....+....5....+....6....+....7....+....8
       *>-----------------------------------------------------------------------
       *>ソートのプログラムサンプル01
       *>SORT_SAMPLE0001
       *>-----------------------------------------------------------------------
       IDENTIFICATION                     DIVISION.
       PROGRAM-ID.                   SORT_SAMPLE01.
       *>-----------------------------------------------------------------------
       *>環境部
       *>-----------------------------------------------------------------------
       ENVIRONMENT                        DIVISION.
       INPUT-OUTPUT                       SECTION.
       FILE-CONTROL.
       *>-----------------------------------------------------------------------
       *>-----------------------------------------------------------------------
       *>入力ファイル
       *>-----------------------------------------------------------------------
       SELECT    IN01-TEST-FILE   ASSIGN       TO   "IN01.txt"
                                  ORGANIZATION IS LINE SEQUENTIAL.
       *>-----------------------------------------------------------------------
       *>中間ファイル（ソート用）
       *>-----------------------------------------------------------------------
       SELECT    ST01-SORT-FILE   ASSIGN       TO   "ST01.txt".
       *>-----------------------------------------------------------------------
       *>出力ファイル
       *>-----------------------------------------------------------------------
       SELECT    OT01-TEST-FILE   ASSIGN       TO   "OT01.txt"
                                  ORGANIZATION IS LINE SEQUENTIAL.
       *>-----------------------------------------------------------------------
       *>データ部
       *>-----------------------------------------------------------------------
       DATA                               DIVISION.
       FILE                               SECTION.
       *>-----------------------------------------------------------------------
       *>IN01-TEST-FILEの定義
       *>-----------------------------------------------------------------------
       FD   IN01-TEST-FILE.
       01   IN01-TEST-FILE-REC.
            03   IN-URIAGE-DATE        PIC 9(008).
            03   IN-SHOHIN.
                 05   IN-SHOHIN-CODE   PIC 9(005).
                 05   IN-SHURUI        PIC 9(003).
            03   IN-SUURYO             PIC 9(003).
            03   IN-TANKA              PIC 9(005).
            03   FILLER                PIC X(016).
       *>-----------------------------------------------------------------------
       *>ST01-SORT-FILEの定義
       *>-----------------------------------------------------------------------
       FD   ST01-SORT-FILE.
       01   ST01-SORT-FILE-REC.
            03   ST-URIAGE-DATE        PIC 9(008).
            03   ST-SHOHIN.
                 05   ST-SHOHIN-CODE   PIC 9(005).
                 05   ST-SHURUI        PIC 9(003).
            03   ST-SUURYO             PIC 9(003).
            03   ST-TANKA              PIC 9(005).
            03   FILLER                PIC X(016).
       *>-----------------------------------------------------------------------
       *>OT01-TEST-FILEの定義
       *>-----------------------------------------------------------------------
       FD   ST01-SORT-FILE.
       01   ST01-SORT-FILE-REC.
            03   OT-URIAGE-DATE        PIC 9(008).
            03   OT-SHOHIN.
                 05   OT-SHOHIN-CODE   PIC 9(005).
                 05   OT-SHURUI        PIC 9(003).
            03   OT-SUURYO             PIC 9(003).
            03   OT-TANKA              PIC 9(005).
            03   FILLER                PIC X(016).
       *>-----------------------------------------------------------------------
       *>手続き部
       *>-----------------------------------------------------------------------
       PROCEDURE                         DIVISION.
       *>
           SORT   ST01-SORT-FILE
                        ON   ASCENDING   KEY   ST-SHOHIN-CODE
                        ON   ASCENDING   KEY   ST-SHURUI
                  USING      IN01-TEST-FILE
                  GIVING     OT01-TEST-FILE.
       *>
           STOP RUN.
       *>-----------------------------------------------------------------------
